# INavisworksExporter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
INavisworksExporter Members
INavisworksExporter Interface Methods See Also
---
The INavisworksExporter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Export | The method that Revit will invoke to perform an export to Navisworks. |
| GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
| GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
| GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
| GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
| GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
| ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

# See Also
INavisworksExporter Interface
Autodesk.Revit.DB Namespace